function myFunction() {
    var txt;
    var number = prompt("생일을 입력하세요", "0424");
    if (number == null || number == "") {
        txt = "User cancelled the prompt.";
    } else if(number == "1005"){
        var name = prompt("닉네임을 입력하세요", "영홍or샤엘");
        if(name == "영홍"){
            txt = "언니~~!! 헤헤 뇨오~!! <br> 언니의 그 말투 더는 볼 수 없을지도 모른다는게 정말 너무 슬프네.. <br>쓰읍... 나는 먼저 탈좀 한당... ㅜㅜ..<br> 사실 나도 접게 될 줄까지는 몰랐는데 어쩌다 보니 이렇게 됐네..ㅎㅎ<br> 언젠가 만나서 놀 날이 있겠제..!! <br>그때 봅시당♡♡";
        }else if(name == "샤엘"){
            txt = "엘언니~♡ <br>언니랑 그래도 예전엔 미작도 좀 하고 게임 했던 거 같은데 <br>요즘은 내가 통 게임을 안해서 그런지 언니랑 많이 못 논거 같네..8ㅁ8 <br>가끔씩 돌직구처럼 던지는 언니 말들에 재밌기도 하고 가끔 무서웠다...?8ㅂ8 <br>근데 엄청 순하구 착한 언니인거 아니까 괜찮았던 거 같아♡♡ <br>천안 팟 우정이여 영원하라! <br>(나도 꼽 좀....)";
        }
    }else if(number == "0722"){
        txt = "간빠~! <br>오빠한테는 참 미안하고 고마워.. <br>수계 때문에 오빠 미워했었는데도 다시 나 받아주고 재밌게 놀아줘서.. <br>내가 왜 이런 사람들을 의심했나 싶어... <br>참..나도 어리석지..ㅎ <br>요즘 과제때문에 엄청 바빠보이던데 ㅜㅜ 힘내구.. <br>프로그래밍쪽으로 어려운거 생기면 언제든 톡해!!! <br>히히 도움이 될지는 모르겠지만 노력은 해볼겡!! <br>난 먼저 좀탈 한다☆";
    }else if(number == "0827"){
        txt = "좀비오빠 <br>요즘 왤케 안보이는지 모르겄네!! <br>예전에도 잘 안보였지만.. 살아있기는 하지..? <br>그 상태면 정말 어디 부러져있다해도 믿을만한 체격이기는 하지...웅웅.... ㅋㅎㅋㅎㅋ <br>가끔 카톡 나와서 게임도 같이하거 놀아주고 그래!! <br>오빠의 그 좀비고 쇼핑백 아직도 기억에 남는다 ㅎㅋㅎㅋㅎ <br>나는 먼저 좀탈한돠~";
    }else if(number == "1118"){
        txt = "여~ 기붹 <br>짜식 요즘 엔나랑 뭐하길래 단톡에서 잘 못봤냐 이자식 너 임뫄!!! <br>엔나 울리면 내가 진짜 가만 안 둘거여!!!! <br>헤헤 엔나 울리는 그 순간 내가 엔나 가져갈거다 ᕙ(•̀‸•́‶)ᕗ <br>뚜시 뚜시 이 쨉도 안대는게 말이여 ㅋ <br>히히 너랑은 진짜 엄청 오래 알고 지냈지 한 4.5년 됐나.. ㅋㅎㅋㅎㅋ <br>그동안 상담 해주고 그래서 너무 고마웠다 짜식 난 먼저 좀탈한다!!~ <br>언제 한번 엔나랑 해서 다같이 만나서 놉싀다!!";
    }else if(number == "1214"){
        txt = "여어 땅꼬맹이 잔~^^ <br>누나는 먼저 좀탈한다 이자식아 <br>너도 공부좀 해 임마 글구 어! <br>너는 말야 여자를 사귀면 여자를 아껴줘야지 방치하면 어쩌냐 ㅡㅡ <br>너가 그래서 안되는거야 알았어?!?! <br>쨋튼 코그모라 불렀어도 꽤 오랫동안 믿고 놀아줬는데 고마웠당 <br>이자식 난 먼저 간다!";
    }else if(number == "1228"){
        txt = "엔ㄴ나ㅏㅏㅏㅏㅏ♡♡ <br>너한테는 편지 안쓸거당 왜냐면 너랑은 앞으로도 계속 연락하고 친구로 지낼그그등 ㅎㅎ <br>물론 다른 사람들도 연락하고 지내겠지만 너만큼 잘 맞고 마음 통하는 애가 별루 읎어.. ♡<br> 내 마음 알제! <br>여름에 좀카페 가기로 한 거 잊지말거 꼭 같이 가는기다!! <br>03즈도 어디를 가게 될 지는 모르겠지만 놀러 가는기야! ♡ 히히";
    }else if(number == "1127"){
        txt = "칠이 이자식!!! 너! <br>내가 예전부터 놀자고 할때 맨날 시간안된다면서 못만나구 말이야! 어! <br>현석이랑 놀자고 할때도 계속 안된다 그러구 ㅡㅡ 으휴! <br>이러다 니 얼굴 잊어버리겠다!! <br>03즈 놀때는 꼭 같이 놀거지? ㅎㅎ <br>가끔씩 한번은 학원 탈출하고 놀자~ <br>이말이야 알았즤 ㅎㅎ ";
    }else if(number == "0214"){
        txt = "감언니.. <br>언니한텐 정말 아직도 미안하고 고마워 <br> 수계 때문에 힘들었을거고 내가 언니 욕도 많이 했는데도.. <br>다시 받아주고 재밌게 놀아주고 내 연애 상담도 해주고 너무 고마워 <br>근데 나 그 사람한테 내 마음은 말하고, 고백은 안하기로 했오.. <br>차이든 받아지든 둘 다 신경쓰여서 제대로 못 살 거 같아..ㅎ <br>그냥 이랬었다~ 하는 과거로 묻어두도 갈려구.. <br>상담해줘서 고마웠구 언니덕에 마음 굳힐 수 있었어<br> 너무 고마워 언니도 꼭 좋은 봄날 올 거구 그동안 너무 힘들었어 이젠 좀 쉬어도 돼 언니.. <br>잠깐은 모든 걸 내려놓고 주변 사람들에게 기대.. <br>정말 수고 많았어 언니";
    }else if(number == "1222"){
        txt = "쵸쵸~~ <br>너의 그림은 항상 내 폰에 소 장 중☆ ㅋㅎㅋㅎ <br>나날히 그림실력이 더 좋아지는거가터 예전에도 귀엽구 뽀쨕했는데 ㅜㅜ <br>요즘은 내가 카페 알림 설정을 안해놔서 그런지 자꾸 단트에 못들어간다...부들...<br> 게임도 많이 못했는데 ㅜㅜ 아쉽다.. <br>정모때 꼭 너를 안고 놀고싶었는데 흑흑 <br>언젠가 그래두 다시 만나서 놀 날이 오겠지?! <br>너도 공부 힘들겠지만 힘내구 열심히 살앙!! <br>난 먼저 좀탈할게!!";
    }else if(number == "0329"){
        txt = "삼퍼언니~~ <br> 나는 비록 게임을 접고 가지만,,<br>언니가 내 대신 랭엠을 먹어줄 날이 올거라고<br>난 믿고 있어.. ㅜㅜ <br> 마지막에 랭하자며 그래도 같이 게임했던 <br> 그 시간들이 잊혀지지 않을 것 같아<br> 물론 랭이어서 스트레스 받고 힘들었지만,<br> 언니들이 재밌게 해준 것 같아서<br> 너무 고마워<br> 사실 예전 힌톨때문에 언니를 그렇게 좋아하진 않았어<br> 근데 지금은 내가 너무 어리석었던 거 같아<br> 그딴 애 때문에 이렇게 멋있는 사람을 <br> 놓칠 뻔 했으니까..<br> 언니 정말 멋있고 좋은 사람이야<br> 너무 고맙구 운프로디테여 영원하라~~!!!!!";
    }else if(number == "0425"){
        txt = "은향언니!! <br> 언니랑은 진짜 게임 많이 안 해본 것 같다..<br> 정모 때도 하필 딱 내가 클 나갔을 때여서<br> 보고 놀지도 못하구 ㅜㅜ <br>내가 딱 고기 구워줘야되는데 말이야...<br> 흑흑 내가 언젠가 천안에 놀러갈게!! <br> 그때는 꼭 해뽕이표 구운고기 & 뽀끔밥을 <br> 드셔보시기를 권장드립니다. ㅎㅎ <br> 헤헤 나는 비록 좀비고에서는 나가지만,<br>연락 계속 할 수 있고 언젠가 때가 되면 만날 수 있으니까<br> 꼭 고기 구워주러 갈게!!! <br> 난 먼저 좀★탈";
    }else if(number == "0226"){
        txt = "연화오빠 <br> 오빠에게는 참 고마워 <br> 여러모로 많은 경험을 하게 해줬고,<br>많은 즐겁고 좋은 추억들 쌓아줘서 고마워<br> 우리가 그 상태로 계속 이어 나갔다면<br> 이 좋았던 추억마저도 안좋게 물들어버려서<br>서로에게 안좋은 기억만으로 남겠지?<br>올해 군대도 조심히 잘 다녀오고,,<br> 언젠가 날이 되면 또 같이 놀자 :) <br>고마웠어<br><br><br><br>p.s.이번달 랭 축하해 ㅎㅎ";
    }else if(number == "0613"){
        txt = "수능오빠<br> 오빠를 다솔에 데려온 게<br>난 꽤 잘 한 일이라고 생각해<br> 오빠랑도 많이 친해질 수 있었고<br>오빠 성격도 예전보다 훨씬 밝아지고 웃음이 많아진 것 같아서<br> 보기 아주 좋아 <br>물론 오빠의 그 빤~ 짝이는 머리도 ㅎㅎ<br> 거짓말인거 알지?ㅋㅋㅋㅋㅋ <br> 오빠는.. 참.. 입만 안열면 괜찮은 사람인데 말이야.........<br> 절레절레....<br> ㅎㅎ 경랭 쭉쭉 올라가서 1위까지는 무리같고<br>2위까지 달성하자~!!!!<br> 나는 뉴비라서 먼저 좀 탈 한다 ㅎㅎ";
    }else if(number == "0219"){
        txt = "캣니언니<br> 우리 여신님 ㅜㅜ <br> 언니 처음 딱 정모가서 봤을때 엄청 놀랬어<br>아니 사람 다리가.. 어떻게 그렇게 얇을 수가 ... 있죠..?<br> 언니 진짜 딱 보자마자 완전 모델인 줄 알았자너...<br> 너무 이뻐 ㅜㅜㅜㅜㅜ <br>왜 다들 여신 여신 하는지 알겠더라니까?! <br>아니 프사보다 실물이 진짜 훨씬 예뻐 <br> 카메라가 너무 눈부셔서 언니의 아름다움을 다 담지 못했나봐,,,,, <br> 카메라 사주고 싶다.....부들부들....<br> 소매넣기도 많이 당했지만.. 언젠가 내가 취직해서<br>아주 크~~게 넣어버려야징 ㅎㅎ<br>나는 웅니 따라서 좀탈하지만, 언젠가 다시 만나서 놀 날이 오면<br> 그때 또 재밌게 놀자!!!!>< ";
    }else if(number == "0304"){
        txt = "우리 푸치..<br> 난 아무래도 비숑보다는 푸치가 훨씬 더 좋고 입에 잘 붙는다...<br> 흑흑<br> 우리도 참 오랫동안 알고 지냈는데 <br>너랑 만나게 해준 건 인벤오빠한테 고마워해야 할 거 같다 ㅋㅋㅋ <br> 유일하게 고마운 점이 너나 다른 사람들을<br> 만나게 해줬다는거?<br> 우리 진짜 만나면 추억팔이 할 얘기 많을텐데 ㅜㅜ<br> 내가 언젠가 꼭 부산 내려갈게 ㅜㅜㅜ <br>그때 나랑 꼭 재밌게 놀아주기다!!! 히히 <br>나는 먼저 좀탈할게 ㅜㅜㅜ<br><br><br>p.s.너의 그림체에 난 취해버렸어...★";
    }else if(number == "0423"){
        txt = "킹언니~~<br> 요즘 카톡방에서 못 보는 거 같어 ㅜㅜ <br> 게임도 내가 잘 안들어가니까 잘 못보구 <br> 엉엉 ㅜㅜ 언니랑 게임 별로 못한 거 같어<br> 약간 언니 방 가면 인싸라서 자리가 없을까봐<br> 관전하다가 쭈글 나왔다는...<br> 흑흑 헤헤 비록 게임은 못했지만<br> 그동안 언니 만화나 이런거 되게 많이 즐겨 봤었어<br>앞으로도 좋은 만화들 많이 그려줬으면 좋겠다 ㅜㅜ 히히<br>나는 먼저 좀탈 할게!!!! 뽀숑 빠숑";
    }else if(number == "0522"){
        txt = "큰일이 이자식<br> 너 대구산다고 어! 정모도 안올려하고 말야!<br> 너 그래도 03즈 놀때는 꼭 올거지? <br> 아마 여름말고 가을쯤에 놀이공원 갈거같은데<br> 그때는 꼭 오자 알았지 자식아<br> 으구 내가 더 말하고 싶은게 많지만 킁킁 너의 사. 생. 활. 이니까^^^^^ 읗흫흫흫흫ㅎㅎ<br> 더 말하진 않을께^^ <br> 짜식 누님은 현세로 간다.!";
    }else if(number == "0920"){
        txt = "스니오빠 <br> 내가 알기론 이미 예전에 알고 있었던 걸로 아는데 맞지? <br> 사실 처음에 오빠 왔다고 들었을 때는 <br> 좀 걱정했었는데 지금은 잘 지내는거 같아서<br> 다행인 것 같아. <br>많이 놀지는 못했지만 그래도 나중에 언젠가는 <br> 또 놀 날이 언젠가는 오겠지.?<br> 군대인 걸로 기억하는데 조심히 잘 하고<br> 힘내!";
    }else if(number == "1016"){
        txt = "실로오빠<br> 자꾸 어! 나랑 반모 하기로 해놓고 <br> 반말 안 하구 말이야ㅡㅡ <br> 좀 속상해~~?? <br> 그래도 정모 때마다 매번 보고 같이 놀아서<br> 재밌었다!! 물론 거미 빼고....<br> 나중에 또 놀게 되면 그때는 <br> 거미는 들고 오지 맙시다....^^^;;;;;; <br> 거미 들고 오면 진짜 내가 메이즈러너 처럼 <br> 미로 하나 건설에서 새벽에 어!! <br>쳐박아 둘거니까 이쒸<br> 히히 핫도그 좋아하는 좀창 실로씌 <br> 전 먼저 좀탈 합니다!!!><";
    }else if(number == "0311"){
        var number2 = prompt("비번을 입력하세요");
        if(number2 == "180304") {
            txt = "너는 진짜 바보 ㅡㅡ.. <br>아파도 말 안하는 바보, <br>아픈 줄도 모르고 남 먼저 챙기는 바보, <br>힘들면서 말 안하는 바보, <br>말 안해주면 모르는 바보..ㅡㅡ <br>내 맘도 몰라주는 바보 ㅡㅡ 이 바보야. (ｰ̀εｰ́) <br><br>내가 왜 너한테만 자꾸 놀아달라고 하고, <br>자꾸 할 일 많은데 디코 들어와서 듣고있고, <br>같이 놀고 그러겠냐 ㅡ3ㅡ <br>사실 나도 지금 이 마음이 그냥 헤어진 외로운 마음에 <br>니가 위로해줬다고 그거에 호감이 생겨서 이러는건지 <br>아니면 그냥 진짜 빠진건진 나도 잘은 모르겠다. <br>근데, 이거 하나는 확신할 수 있다. <br>너가 신경쓰인다는거. <br>위로 받을 때는 인식 못했는데 <br>니 상처를 알게 되고 나니까 너란 사람이 더 신경 쓰이더라, <br>동정이 아니라 그냥 너라는 사람이 <br>어떤 아픔을 지고 있는지, <br>어떻게 살아왔는지, <br>무슨 생각을 하는지, <br>뭘 하고 있는지 누구랑 놀고 있는지.. <br>너랑 자꾸 전화하고 싶고 놀고 싶고 장난치고 싶고 <br>자꾸 너가 신경쓰인다.<br> 근데 너한테 고백은 안할거야. <br>아직 니 맘이 정리 안된것도 다 보이고 <br>글고 내가 고백해서 차이면 힘들어서 현세에 못 살거같고 <br>받아주면 신경 못써줄거같아서 고백은 안 할거야.<br> 글구 이 편지를 니가 읽으면 그 이상 연락두 안 할거야.<br> 그냥 내가 너를 좋아했었다 그랬었다 이러고 끝낼거야. <br>지금까지 잘 해왔던 것처럼 그냥 친구사이로.. <br>당분간은 정말 게임이고 연락이고 안 하고 안 보고 <br>열심히 내 미래를 위해 준비할거야.. <br>사실 그냥 도망가는거긴 해. <br>두려워서.. <br>그동안 고마웠고 재밌었다 ㅎㅎ <br>너덕분에 위로도 많이 받고 웃음도 많이 찾고, <br>속이 말이 아니었는데 그래도 너 덕분에 견딜 수 있었어.<br> 고마워. <br>아마..03즈 모이는건 가을쯤 되야 만나지 않을까 싶다 ㅎㅎ <br>하 이런 편지 쓰다보니까 안경에 습기차네 자꾸 ㅡㅡ <br>에혀! 너도 공부 열심히 하구 힘내 좋아한당 ㅎ (ღゝν')ﾉ♥<br><br><br><br>  p.s. 애들이랑 꼭 대화로 얘기하면서 풀어.. <br>자연스럽게 풀리는거 쌓이고 있는거야. <br>계속 서로 쌓아두다가 진짜 큰일나지 말구 알았지 ㅎㅁㅎ";
        }
    }else if(number == "0929"){
        txt = "유부언니이이 ㅜㅜㅜ <br> 언니가 돌아왔지만 자주 못논 거 같아 ㅜㅜㅜ<br> 언니의 그 웃음 소리 예전과 다르게 약간 어두워진 거 같아..<br> 예전에는 정말 이어폰이 규모 9.0의 지진 정도로 울리는 <br> 그런 통쾌하고 유쾌한 웃음이었는데 ㅜㅜ<br> 요즘은 많이 힘들어보인달까 약간 피곤해보인달까...<br> ㅜㅜ 너무 무리하지말고 공부하느라 정말 힘들텐데<br>항상 고생이 많앙 ㅜㅜㅜ <br>그래도 다시 돌아와서 잠시나마 같이 놀 수 있었던게 너무 기쁘다!!!<br>이히히 정모때 꼭 언니를 보고 싶어했는데 ㅜㅜㅜ <br>결국 이번에도 ㅜㅜ  못보는구나 ㅜㅜㅜ<br> 그래도 나중에 꼭 만나서 고기 구워줄게~!!! <br> 옵하 믿지... 윱우야...?♥";
    }else if(number == "0815"){
        txt = "박스언니 ㅜㅜ <br>요즘 너무 못본거 같아<br>요즘 많이 바뿨..?<br>언니 맨 처음 들어왔을때는 그래도 디코에서 자주 보고 그랬는데<br> 요즘은 톡이나 디코에서나 못 보는거같아 ㅜㅜ<br> 맨날 테런한다고 떠있구 ㅋㅋㅎㅋㅎㅋㅎ<br> 감언니가 불만이던데?! 맨날 테런한다고!!<br> ㅋㅋㅋㅋㅋ 언니랑도 정모 가서 놀고 싶었는데,,,, ㅜㅜㅜㅜ <br> 언젠가 다시 만날 수 있겠지?!?!?!? <br>히히히 나는 먼저 좀탈합니다용 ㅎㅎ<br> 언니도 내가 꼭 만나면 고기 구워줄게!!";
    }
    document.getElementById("demo").innerHTML = txt;
}